{"pageProps":{"slug":"hello-world","content":"<h2 id=\"foreword\">Foreword</h2>\n<p>Hello world, I&#39;m <strong>Josh Wheeler</strong>, a self-taught Software Engineer based in\nLondon. As of the time of writing this blog post, I work as a Full Stack\nDeveloper for an insuretech startup called <strong>By Miles</strong>.</p>\n<p>In this inaugural blog post, I will go over why I have decided to blog and the\ntype of content you can expect from me in the future. In addition, it is only\nfitting that I properly introduce myself and summarise my journey on how I\nbecame a full stack web developer.</p>\n<p>In addition, I&#39;ll highlight some of the key resources that helped me on my\njourney, in the hope of assisting aspiring web developers.</p>\n<h2 id=\"why-i-decided-to-blog\">Why I Decided To Blog?</h2>\n<p>Blogging is an activity that I&#39;ve always wanted to try, but sadly I&#39;ve never\nbeen motivated enough to find the time for it. It wasn&#39;t until recently, after\nlistening to <a target=\"_blank\" rel=\"nofollow\" href=\"https://open.spotify.com/episode/6zZwXsre7cdeUX10zqXBTb?si=tqYz33nNQq6QOox6frP8pQ&amp;dl_branch=1&amp;nd=1\">an informative episode</a> of the <a target=\"_blank\" rel=\"nofollow\" href=\"https://reactpodcast.simplecast.com/\"><em>&#39;React\nPodcast&#39;</em></a>, that I finally found the inspiration to make time to build\nand write my own blog.</p>\n<p>This particular episode featured a guest by the name of Shawn Yang. Some people\nmay recognise his handle, <a target=\"_blank\" rel=\"nofollow\" href=\"https://twitter.com/swyx\">Swyx</a>, from twitter or even reddit (he is\none of the main moderators of the <a target=\"_blank\" rel=\"nofollow\" href=\"https://www.reddit.com/r/reactjs\">/r/reactjs</a> subreddit). On\nthe show, Shawn (Swyx) talked about his upcoming book <a target=\"_blank\" rel=\"nofollow\" href=\"https://www.learninpublic.org/\">&#39;<em>The Coding Career\nHandbook</em>&#39;</a> and his concept of &#39;learning in public&#39;, which in short, is\nthe practice of publishing your learning on public mediums to enhance your\nself-development and learning.</p>\n<blockquote>\n<p>It&#39;s also important to understand that learning in public <em>not only</em> benefits\nyour own development, but also <em>others</em> in the community!</p>\n</blockquote>\n<p>Instantly I was sold on the benefits of learning in public, both for my own\ngrowth and for being able to pay my learnings forward to others. So after\nlistening to the episode, I made a commitment to myself to build and write my\nown tech blog.</p>\n<p>Whilst I haven&#39;t set any quantitative goals yet, I will aim to\npublish a new post at least once a month. Though that might sound like a small\ncommitment, the key to keeping myself motivated is by working towards small\nachievable goals. This is something I learned the hard way as a self-taught\nsoftware engineer.</p>\n<h2 id=\"what-will-i-be-blogging-about\">What Will I Be Blogging About?</h2>\n<p>With learning in public being a key motivator to starting this blog, I will\nfocus my blogging on things I&#39;m learning / building, useful things I&#39;ve learned\nas a full stack web developer, and any general documentation that future Josh\nwill appreciate. Expect topics ranging from React and Node, all the way to AWS\nand even Vim ❤️.</p>\n<p>The blog will be targetting junior to intermediate level web developers\ndepending on the topic at hand. My aim is for at least <strong>one</strong> of my posts to\nbe of help to someone.</p>\n<h2 id=\"now-a-bit-about-me\">Now, A Bit About Me</h2>\n<p>I graduated from the University of Western Australia in 2015, with a Master&#39;s\nDegree in Civil Engineering and a Bachelor of Finance. Although I was exposed\nto <em>some</em> programming at university (MATLAB and Python), I never considered it\nto be a viable skill for a career (oh, the irony).</p>\n<p>After graduating, I started working full time as a Highways and Traffic\nengineer at a multinational civil engineering consultancy. In this role, I was\nfortunate enough to be involved in the design of many major motorways and\ninterchanges across Australia.</p>\n<p>Although the civil engineering work was challenging, my heart wasn&#39;t truly in\nit. It wasn&#39;t until one day, where I was <em>&#39;fortunate&#39;</em> enough to be put onto a\n<em>very</em> menial task, that a light bulb flicked on in my head. &#39;Hey, a computer\ncould be programmed to do this a lot quicker than me, so why don&#39;t I have a\ncrack at making that happen?&#39;.</p>\n<p>Using the knowledge I acquired in my programming subjects at university, I\nspent the rest of the day and night writing a script in Python that did the\ntask for me. The script was a success! What was previously a 4 hour manual task\nfor a human to process, only took the computer less than a second. I was hooked\n,solving problems via programming became an addiction. From this point forward,\nI <em>immediately</em> knew I had found my true passion.</p>\n<p>Over the next year, I started taking programming more seriously, going deeper\ninto learning Python and VBA (to write applications in Excel) in my own time,\nwith the goal of becoming quicker and better at writing scripts for\nlaborious tasks at work. As I got better, I started hunting for more and\nmore automation opportunities in our team.</p>\n<p>It eventually got to a point where I was undertaking more development work than\nactual civil engineering work. I was finally enjoying my job.</p>\n<p>This sense of enjoyment finally gave me the confidence I needed to make the big\ndecision of completely transitioning out of civil engineering to software\nengineering.</p>\n<p>In July 2019, I was lucky enough to find an opportunity in the company&#39;s London\noffice. The role of the job was to develop automation tools for civil engineers\nfull time, which perfectly aligned with my skills and experience. Luckily, my\npartner was also able to find a job in her field, so we packed our bags and off\nwe went.</p>\n<p>Early on, I mostly developed Python applications that ran locally on people&#39;s\ncomputers. But, it didn&#39;t take long before the shortcomings and frustrations of\ndeploying software in this fashion, led me to embark on a wild goose chase to\nfind a better way.</p>\n<p>This is when I discovered the <strong>excitingly overwhelming</strong> world of web\ndevelopment. Somehow everything finally clicked, and I saw web applications as\nthe solution to all my problems I was facing. This realisation was enough to\nmotivate me to begin my journey to become a <em>self-taught</em> full stack web\ndeveloper.</p>\n<p>Fast-forward to 2021, and <strong>today</strong> marks my <strong>2 year anniversary</strong> since\narriving in London. I now work for an insuretech startup, building full stack\nweb and mobile applications in Node.js and React. I also work a lot in the\ncloud with AWS, deploying both containerised and serverless applications and\nworking with relational (Postgres) and non-relational (DynamoDB) databases.</p>\n<p>With <strong>1.5</strong> years of experience under my belt and many blood, sweat and tears,\nI would like to offer some advice to others that may be starting their own\njourney.</p>\n<h2 id=\"self-taught-full-stack-web-development\">Self-taught Full Stack Web Development</h2>\n<p>So how does one even start learning to become a full stack web developer? It is\nvery easy to quickly become overwhelmed with the breadth of technology and\ntools required for full stack web development. I assume this is what scares a\nlot of people off early in their journey.</p>\n<p>Upon reflection, I was very fortunate that a combination of passion, prior\nknowledge and a heavy appetite for problem-solving was enough to fuel me for my\njourney. But don&#39;t get me wrong, it wasn&#39;t easy. It took over a year of\nvery hard work and dedication until I was able to successfully and comfortably\nbuild full stack web applications in the cloud. So <em>please</em>, don&#39;t give up!</p>\n<p>There is a lot of information on the Internet. Knowing what is good, and what\nis not so good is important. So, I would like to offer a list of resources that\nwere influential on my journey. Essentially, this is a list I would have liked\nto be given when I started.</p>\n<h3 id=\"udemy-courses-by-jonas-schmedtmann\">Udemy courses by Jonas Schmedtmann</h3>\n<p>Although <a target=\"_blank\" rel=\"nofollow\" href=\"https://www.udemy.com/user/jonasschmedtmann/\">Jonas</a> isn&#39;t the first name that comes up in a lot of the\nlearning web development subreddits, he is easily one of the <em>best</em> on Udemy.\nHis course content and the depth that he goes into is unmatched in my opinion.</p>\n<p>The things you build in his courses are also really fun and visually appealing,\nwhich helped keep me engaged. I would highly recommend his\n<a target=\"_blank\" rel=\"nofollow\" href=\"https://www.udemy.com/course/the-complete-javascript-course/\">JavaScript</a>, <a target=\"_blank\" rel=\"nofollow\" href=\"https://www.udemy.com/course/advanced-css-and-sass/\">Advanced CSS and Sass</a> and\n<a target=\"_blank\" rel=\"nofollow\" href=\"https://www.udemy.com/course/nodejs-express-mongodb-bootcamp/\">Node.JS</a> courses in particular. The course are always on sale\nthrough the year (~£10-15), so please don&#39;t pay full price for them!</p>\n<h3 id=\"full-stack-open\">Full Stack Open</h3>\n<p>After Jonas&#39; course, I felt like I needed to learn a JS framework and extend my\noverall full stack knowledge. This is where <a target=\"_blank\" rel=\"nofollow\" href=\"https://fullstackopen.com/en/\">Full Stack Open</a> came in, a\nfree online bootcamp by the University of Helsinki that deep dive&#39;s into modern\nweb development. I can not recommend this enough.</p>\n<p>The no hand-holding, practical style of delivery is exactly the kind of course\nthat really makes you learn. You are thrown directly into the deep-end from\nearly on, but if you can swim, you will come out with a very well-rounded set\nof skills and understanding.</p>\n<h3 id=\"developer-roadmaps\">Developer Roadmaps</h3>\n<p>Let&#39;s be real. Learning full stack web development is <em>bloody hard</em>. The list\nof technologies to learn seems to be ever-growing. This is where these\n<a target=\"_blank\" rel=\"nofollow\" href=\"https://roadmap.sh/\">community-made roadmaps</a> come in. They helped me filter out the\nnoise, and allowed me to hone in on the actual critical skills a full stack\nengineer requires in this modern world.</p>\n<h3 id=\"learn-git\">Learn Git</h3>\n<p><a target=\"_blank\" rel=\"nofollow\" href=\"https://github.com/signup\">Create</a> a free GitHub account and start getting into the habit of\ncommitting <em><strong>EVERYTHING</strong></em> you do. Have a look at <a target=\"_blank\" rel=\"nofollow\" href=\"https://github.com/k88hudson/git-flight-rules?utm_source=tldrnewsletter\">this link</a> for an\nawesome list of git commands displayed by user stories.</p>\n<h3 id=\"get-comfortable-in-the-terminal-and-using-clis\">Get Comfortable In The Terminal And Using CLI&#39;s</h3>\n<p><a target=\"_blank\" rel=\"nofollow\" href=\"https://linuxjourney.com/\">Linux Journey</a> - A lot of people put off using and getting comfortable\nwith the terminal. <strong>DON&#39;T DO THIS</strong>. Get used to it from day 1 please. As a\ndeveloper, you will basically live inside the terminal for most of your day, so\nit&#39;s critical that you are comfortable with it.</p>\n<p>If you are using a unix-based machine i.e. Linux or Mac, Linux Journey is a\ngreat resource for beginners to learn the most useful commands for day-to-day\nwork in the terminal.</p>\n<p>For a bonus tip, making your terminal look nice goes a long way with user\nexperience. Have a look into using zsh (default shell with newer Macs) and the\n<a target=\"_blank\" rel=\"nofollow\" href=\"https://github.com/ohmyzsh/ohmyzsh\">oh-my-zsh</a> plugin to spice up your terminal</p>\n<h3 id=\"syntax-fm-podcast\">Syntax FM Podcast</h3>\n<p><a target=\"_blank\" rel=\"nofollow\" href=\"https://syntax.fm/\">Syntax</a> favourite web development podcast. Again, in such a\nfast-moving industry, it&#39;s hard to stay on top of all the latest news,\nframeworks and tooling. Hosted by <a target=\"_blank\" rel=\"nofollow\" href=\"https://twitter.com/wesbos\">Wes Bos</a> and <a target=\"_blank\" rel=\"nofollow\" href=\"https://twitter.com/stolinski\">Scott Tolinski</a>,\nthe podcast keeps you up to speed with everything that&#39;s going on and there\nare many deep dive episodes to help beginners with certain topics. Definitely\nsubscribe to this and listen to some older episodes.</p>\n<h3 id=\"aws-certified-developer---associate\"><a target=\"_blank\" rel=\"nofollow\" href=\"https://www.udemy.com/course/aws-certified-developer-associate-dva-c01/\">AWS Certified Developer - Associate</a></h3>\n<p>Let&#39;s face it, with the rapid growth of the cloud in recent years, more\ncompanies are hiring full stack developers with cloud experience. I know...\nanother thing you have to learn, but having a great foundation of cloud\nengineering skills can really set you apart from other developers. However, I\nwould put this last in terms of your learning priorities as it&#39;s just a bonus.</p>\n<p>Learning cloud was possibly the most difficult part for me. Yes there are a lot\nof services to learn, but the hard part was understanding the underlying domain\nknowledge of infrastructure and networking.</p>\n<p>I recommend not jumping into AWS without the aid of a course. This Udemy course\nhelped me get a better grasp of cloud in general, and also helped me obtain the\nAWS certification too. As a bonus, I recommend subscribing to the <a target=\"_blank\" rel=\"nofollow\" href=\"https://www.youtube.com/channel/UCraiFqWi0qSIxXxXN4IHFBQ\">Be A Better\nDev</a> channel - he is very underrated youtuber who delivers high quality\ncloud tutorial content.</p>\n<h3 id=\"learning-how-to-google\">Learning How To Google</h3>\n<p>Learn how to Google, and don&#39;t feel like an imposter for doing so. I won&#39;t go\ninto much detail on this point, as you can find a plethora of articles online\nabout this. But please, get good at knowing how to Google. Being specific with\nthe language, library and error message in your search goes a long way.</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>That was a long first blog, so I&#39;ll wrap it up here. I hope someone out\nthere will be able to benefit from some of this advice. If the blog <em>was</em>\nhelpful or you just have a general question, please feel free to <a target=\"_blank\" rel=\"nofollow\" href=\"mailto:jltwheeler@gmail.com?subject=%5BBlog%5D\">get in touch</a>.\nOtherwise, see you in my next post!</p>\n<p><img src=\"https://media.giphy.com/media/3o6EhGvKschtbrRjX2/giphy.gif\" alt=\"\"></p>\n<!--- MARKDOWN LINKS -->\n\n","data":{"id":1,"title":"Hello World","description":"My first blog post - an introduction to who I am and why I'm starting to blog, along with some resource tips for aspiring full stack web developers.","date":"July 22 2021","readTime":"11 min read"}},"__N_SSG":true}